app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "title", "updated_at", "author", "price", "published_date") VALUES ('2026-09-14 02:03:44.545779', 'The Pragmatic Programmer', '2026-09-14 02:03:44.545779', 'Andy Hunt', 39.99, '1999-10-20') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = 'Refactoring', "updated_at" = '2026-09-14 02:04:03.569432', "author" = 'Martin Fowler', "price" = 49.99, "published_date" = '2018-11-20' WHERE "books"."id" = 1
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = 1
---
  def destroy
    @book.destroy!

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
    def set_book
      @book = Book.find(params.expect(:id))