app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "title", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Refactoring"], ["updated_at", "2026-09-14 01:58:04.732388"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "user_books".* FROM "user_books" WHERE "user_books"."book_id" = $1  [["book_id", 14]]
---
    def set_book
      @book = Book.find(params.expect(:id))