app/controllers/user_books_controller.rb

INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (5, 4, '2026-09-14 03:31:18.664884', '2026-09-14 03:31:18.664884') RETURNING "id"
---
  def create
    @user_book = UserBook.new(user_book_params)

    respond_to do |format|
      if @user_book.save

DELETE FROM "user_books" WHERE "user_books"."id" = 4
---
  def destroy
    @user_book.destroy!

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = 4 LIMIT 1
---
    def set_user_book
      @user_book = UserBook.find(params.expect(:id))