app/controllers/user_books_controller.rb

SELECT "user_books".* FROM "user_books"
---
  def index
    @user_books = UserBook.includes(:user, :book)

INSERT INTO "user_books" ("book_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["book_id", 56], ["created_at", "2026-09-14 03:50:46.613297"], ["updated_at", "2026-09-14 03:50:46.613297"], ["user_id", 20]]
---
  def create
    @user_book = UserBook.new(user_book_params)

    respond_to do |format|
      if @user_book.save

UPDATE "user_books" SET "book_id" = $1, "updated_at" = $2 WHERE "user_books"."id" = $3  [["book_id", 61], ["updated_at", "2026-09-14 03:50:46.628002"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @user_book.update(user_book_params)

DELETE FROM "user_books" WHERE "user_books"."id" = $1  [["id", 13]]
---
  def destroy
    @user_book.destroy!

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def set_user_book
      @user_book = UserBook.find(params.expect(:id))

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC
SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
---
    def set_form_options
      @users = User.order(:username)
      @books = Book.order(:title)